jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), CURR1_DCB */
#define BOARD_INITADCPINS_CURR1_DCB_PERIPHERAL                              ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR1_DCB_SIGNAL                                    IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR1_DCB_CHANNEL                                   1U   /*!< ADC1 IN channel: 1 */
#define BOARD_INITADCPINS_CURR1_DCB_PIN_NAME                       GPIO_AD_B0_12   /*!< Pin name */
#define BOARD_INITADCPINS_CURR1_DCB_LABEL                            "CURR1_DCB"   /*!< Label */
#define BOARD_INITADCPINS_CURR1_DCB_NAME                             "CURR1_DCB"   /*!< Identifier name */

/* GPIO_AD_B0_13 (coord L14), VOLT1_DCB */
#define BOARD_INITADCPINS_VOLT1_DCB_PERIPHERAL                              ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_VOLT1_DCB_SIGNAL                                    IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_VOLT1_DCB_CHANNEL                                   2U   /*!< ADC1 IN channel: 2 */
#define BOARD_INITADCPINS_VOLT1_DCB_PIN_NAME                       GPIO_AD_B0_13   /*!< Pin name */
#define BOARD_INITADCPINS_VOLT1_DCB_LABEL                            "VOLT1_DCB"   /*!< Label */
#define BOARD_INITADCPINS_VOLT1_DCB_NAME                             "VOLT1_DCB"   /*!< Identifier name */

/* GPIO_AD_B0_14 (coord H14), CURR2_DCB */
#define BOARD_INITADCPINS_CURR2_DCB_PERIPHERAL                              ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_DCB_SIGNAL                                    IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_DCB_CHANNEL                                   3U   /*!< ADC1 IN channel: 3 */
#define BOARD_INITADCPINS_CURR2_DCB_PIN_NAME                       GPIO_AD_B0_14   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_DCB_LABEL                            "CURR2_DCB"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_DCB_NAME                             "CURR2_DCB"   /*!< Identifier name */

/* GPIO_AD_B0_15 (coord L10), VOLT2_DCB */
#define BOARD_INITADCPINS_VOLT2_DCB_PERIPHERAL                              ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_VOLT2_DCB_SIGNAL                                    IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_VOLT2_DCB_CHANNEL                                   4U   /*!< ADC1 IN channel: 4 */
#define BOARD_INITADCPINS_VOLT2_DCB_PIN_NAME                       GPIO_AD_B0_15   /*!< Pin name */
#define BOARD_INITADCPINS_VOLT2_DCB_LABEL                            "VOLT2_DCB"   /*!< Label */
#define BOARD_INITADCPINS_VOLT2_DCB_NAME                             "VOLT2_DCB"   /*!< Identifier name */

/* GPIO_AD_B1_00 (coord J11), CURR1_A */
#define BOARD_INITADCPINS_CURR1_A_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR1_A_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR1_A_CHANNEL                                     5U   /*!< ADC1 IN channel: 5 */
#define BOARD_INITADCPINS_CURR1_A_PIN_NAME                         GPIO_AD_B1_00   /*!< Pin name */
#define BOARD_INITADCPINS_CURR1_A_LABEL                                "CURR1_A"   /*!< Label */
#define BOARD_INITADCPINS_CURR1_A_NAME                                 "CURR1_A"   /*!< Identifier name */

/* GPIO_AD_B1_01 (coord K11), CURR1_B */
#define BOARD_INITADCPINS_CURR1_B_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR1_B_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR1_B_CHANNEL                                     6U   /*!< ADC1 IN channel: 6 */
#define BOARD_INITADCPINS_CURR1_B_PIN_NAME                         GPIO_AD_B1_01   /*!< Pin name */
#define BOARD_INITADCPINS_CURR1_B_LABEL                                "CURR1_B"   /*!< Label */
#define BOARD_INITADCPINS_CURR1_B_NAME                                 "CURR1_B"   /*!< Identifier name */

/* GPIO_AD_B1_02 (coord L11), CURR1_C */
#define BOARD_INITADCPINS_CURR1_C_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR1_C_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR1_C_CHANNEL                                     7U   /*!< ADC1 IN channel: 7 */
#define BOARD_INITADCPINS_CURR1_C_PIN_NAME                         GPIO_AD_B1_02   /*!< Pin name */
#define BOARD_INITADCPINS_CURR1_C_LABEL                                "CURR1_C"   /*!< Label */
#define BOARD_INITADCPINS_CURR1_C_NAME                                 "CURR1_C"   /*!< Identifier name */

/* GPIO_AD_B1_03 (coord M12), CURR2_A */
#define BOARD_INITADCPINS_CURR2_A_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_A_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_A_CHANNEL                                     8U   /*!< ADC1 IN channel: 8 */
#define BOARD_INITADCPINS_CURR2_A_PIN_NAME                         GPIO_AD_B1_03   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_A_LABEL                                "CURR2_A"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_A_NAME                                 "CURR2_A"   /*!< Identifier name */

