jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_AD_B1_04 (coord L12), CURR2_B */
#define BOARD_INITADCPINS_CURR2_B_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_B_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_B_CHANNEL                                     9U   /*!< ADC1 IN channel: 9 */
#define BOARD_INITADCPINS_CURR2_B_PIN_NAME                         GPIO_AD_B1_04   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_B_LABEL                                "CURR2_B"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_B_NAME                                 "CURR2_B"   /*!< Identifier name */

/* GPIO_AD_B1_05 (coord K12), CURR2_C */
#define BOARD_INITADCPINS_CURR2_C_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_C_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_C_CHANNEL                                    10U   /*!< ADC1 IN channel: 10 */
#define BOARD_INITADCPINS_CURR2_C_PIN_NAME                         GPIO_AD_B1_05   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_C_LABEL                                "CURR2_C"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_C_NAME                                 "CURR2_C"   /*!< Identifier name */

/* GPIO_AD_B1_06 (coord J12), CURR3_A */
#define BOARD_INITADCPINS_CURR3_A_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR3_A_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR3_A_CHANNEL                                    11U   /*!< ADC1 IN channel: 11 */
#define BOARD_INITADCPINS_CURR3_A_PIN_NAME                         GPIO_AD_B1_06   /*!< Pin name */
#define BOARD_INITADCPINS_CURR3_A_LABEL                                "CURR3_A"   /*!< Label */
#define BOARD_INITADCPINS_CURR3_A_NAME                                 "CURR3_A"   /*!< Identifier name */

/* GPIO_AD_B1_07 (coord K10), CURR3_B */
#define BOARD_INITADCPINS_CURR3_B_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR3_B_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR3_B_CHANNEL                                    12U   /*!< ADC1 IN channel: 12 */
#define BOARD_INITADCPINS_CURR3_B_PIN_NAME                         GPIO_AD_B1_07   /*!< Pin name */
#define BOARD_INITADCPINS_CURR3_B_LABEL                                "CURR3_B"   /*!< Label */
#define BOARD_INITADCPINS_CURR3_B_NAME                                 "CURR3_B"   /*!< Identifier name */

/* GPIO_AD_B1_08 (coord H13), CURR3_C */
#define BOARD_INITADCPINS_CURR3_C_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR3_C_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR3_C_CHANNEL                                    13U   /*!< ADC1 IN channel: 13 */
#define BOARD_INITADCPINS_CURR3_C_PIN_NAME                         GPIO_AD_B1_08   /*!< Pin name */
#define BOARD_INITADCPINS_CURR3_C_LABEL                                "CURR3_C"   /*!< Label */
#define BOARD_INITADCPINS_CURR3_C_NAME                                 "CURR3_C"   /*!< Identifier name */

/* GPIO_AD_B1_09 (coord M13), CURR4_A */
#define BOARD_INITADCPINS_CURR4_A_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR4_A_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR4_A_CHANNEL                                    14U   /*!< ADC1 IN channel: 14 */
#define BOARD_INITADCPINS_CURR4_A_PIN_NAME                         GPIO_AD_B1_09   /*!< Pin name */
#define BOARD_INITADCPINS_CURR4_A_LABEL                                "CURR4_A"   /*!< Label */
#define BOARD_INITADCPINS_CURR4_A_NAME                                 "CURR4_A"   /*!< Identifier name */

/* GPIO_AD_B1_10 (coord L13), CURR4_B */
#define BOARD_INITADCPINS_CURR4_B_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR4_B_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR4_B_CHANNEL                                    15U   /*!< ADC1 IN channel: 15 */
#define BOARD_INITADCPINS_CURR4_B_PIN_NAME                         GPIO_AD_B1_10   /*!< Pin name */
#define BOARD_INITADCPINS_CURR4_B_LABEL                                "CURR4_B"   /*!< Label */
#define BOARD_INITADCPINS_CURR4_B_NAME                                 "CURR4_B"   /*!< Identifier name */

/* GPIO_AD_B1_11 (coord J13), CURR4_C */
#define BOARD_INITADCPINS_CURR4_C_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR4_C_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR4_C_CHANNEL                                     0U   /*!< ADC1 IN channel: 0 */
#define BOARD_INITADCPINS_CURR4_C_PIN_NAME                         GPIO_AD_B1_11   /*!< Pin name */
#define BOARD_INITADCPINS_CURR4_C_LABEL                                "CURR4_C"   /*!< Label */
#define BOARD_INITADCPINS_CURR4_C_NAME                                 "CURR4_C"   /*!< Identifier name */

/* GPIO_AD_B1_12 (coord H12), CURR3_DCB */
#define BOARD_INITADCPINS_CURR3_DCB_PERIPHERAL                              ADC2   /*!< Device name: ADC2 */
#define BOARD_INITADCPINS_CURR3_DCB_SIGNAL                                    IN   /*!< ADC2 signal: IN */
#define BOARD_INITADCPINS_CURR3_DCB_CHANNEL                                   1U   /*!< ADC2 IN channel: 1 */
#define BOARD_INITADCPINS_CURR3_DCB_PIN_NAME                       GPIO_AD_B1_12   /*!< Pin name */
#define BOARD_INITADCPINS_CURR3_DCB_LABEL                            "CURR3_DCB"   /*!< Label */
#define BOARD_INITADCPINS_CURR3_DCB_NAME                             "CURR3_DCB"   /*!< Identifier name */

/* GPIO_AD_B1_13 (coord H11), VOLT3_DCB */
#define BOARD_INITADCPINS_VOLT3_DCB_PERIPHERAL                              ADC2   /*!< Device name: ADC2 */
#define BOARD_INITADCPINS_VOLT3_DCB_SIGNAL                                    IN   /*!< ADC2 signal: IN */
#define BOARD_INITADCPINS_VOLT3_DCB_CHANNEL                                   2U   /*!< ADC2 IN channel: 2 */
#define BOARD_INITADCPINS_VOLT3_DCB_PIN_NAME                       GPIO_AD_B1_13   /*!< Pin name */
#define BOARD_INITADCPINS_VOLT3_DCB_LABEL                            "VOLT3_DCB"   /*!< Label */
#define BOARD_INITADCPINS_VOLT3_DCB_NAME                             "VOLT3_DCB"   /*!< Identifier name */

/* GPIO_AD_B1_14 (coord G12), CURR4_DCB */
#define BOARD_INITADCPINS_CURR4_DCB_PERIPHERAL                              ADC2   /*!< Device name: ADC2 */
#define BOARD_INITADCPINS_CURR4_DCB_SIGNAL                                    IN   /*!< ADC2 signal: IN */
#define BOARD_INITADCPINS_CURR4_DCB_CHANNEL                                   3U   /*!< ADC2 IN channel: 3 */
#define BOARD_INITADCPINS_CURR4_DCB_PIN_NAME                       GPIO_AD_B1_14   /*!< Pin name */
#define BOARD_INITADCPINS_CURR4_DCB_LABEL                            "CURR4_DCB"   /*!< Label */
#define BOARD_INITADCPINS_CURR4_DCB_NAME                             "CURR4_DCB"   /*!< Identifier name */

/* GPIO_AD_B1_15 (coord J14), VOLT4_DCB */
#define BOARD_INITADCPINS_VOLT4_DCB_PERIPHERAL                              ADC2   /*!< Device name: ADC2 */
#define BOARD_INITADCPINS_VOLT4_DCB_SIGNAL                                    IN   /*!< ADC2 signal: IN */
#define BOARD_INITADCPINS_VOLT4_DCB_CHANNEL                                   4U   /*!< ADC2 IN channel: 4 */
#define BOARD_INITADCPINS_VOLT4_DCB_PIN_NAME                       GPIO_AD_B1_15   /*!< Pin name */
#define BOARD_INITADCPINS_VOLT4_DCB_LABEL                            "VOLT4_DCB"   /*!< Label */
#define BOARD_INITADCPINS_VOLT4_DCB_NAME                             "VOLT4_DCB"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAdcPins(void);

/* GPIO_EMC_23 (coord G2), PWM1_AT */
#define BOARD_INITPWMPINS_PWM1_AT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_AT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_AT_CHANNEL                                     0U   /*!< PWM1 A channel: 0 */
#define BOARD_INITPWMPINS_PWM1_AT_PIN_NAME                           GPIO_EMC_23   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_AT_LABEL                                "PWM1_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_AT_NAME                                 "PWM1_AT"   /*!< Identifier name */

/* GPIO_EMC_24 (coord D3), PWM1_AB */
#define BOARD_INITPWMPINS_PWM1_AB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_AB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_AB_CHANNEL                                     0U   /*!< PWM1 B channel: 0 */
#define BOARD_INITPWMPINS_PWM1_AB_PIN_NAME                           GPIO_EMC_24   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_AB_LABEL                                "PWM1_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_AB_NAME                                 "PWM1_AB"   /*!< Identifier name */

