jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_EMC_25 (coord D2), PWM1_BT */
#define BOARD_INITPWMPINS_PWM1_BT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_BT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_BT_CHANNEL                                     1U   /*!< PWM1 A channel: 1 */
#define BOARD_INITPWMPINS_PWM1_BT_PIN_NAME                           GPIO_EMC_25   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_BT_LABEL                                "PWM1_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_BT_NAME                                 "PWM1_BT"   /*!< Identifier name */

/* GPIO_EMC_26 (coord B3), PWM1_BB */
#define BOARD_INITPWMPINS_PWM1_BB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_BB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_BB_CHANNEL                                     1U   /*!< PWM1 B channel: 1 */
#define BOARD_INITPWMPINS_PWM1_BB_PIN_NAME                           GPIO_EMC_26   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_BB_LABEL                                "PWM1_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_BB_NAME                                 "PWM1_BB"   /*!< Identifier name */

/* GPIO_EMC_27 (coord A2), PWM1_CT */
#define BOARD_INITPWMPINS_PWM1_CT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_CT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_CT_CHANNEL                                     2U   /*!< PWM1 A channel: 2 */
#define BOARD_INITPWMPINS_PWM1_CT_PIN_NAME                           GPIO_EMC_27   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_CT_LABEL                                "PWM1_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_CT_NAME                                 "PWM1_CT"   /*!< Identifier name */

/* GPIO_EMC_28 (coord D1), PWM1_CB */
#define BOARD_INITPWMPINS_PWM1_CB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_CB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_CB_CHANNEL                                     2U   /*!< PWM1 B channel: 2 */
#define BOARD_INITPWMPINS_PWM1_CB_PIN_NAME                           GPIO_EMC_28   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_CB_LABEL                                "PWM1_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_CB_NAME                                 "PWM1_CB"   /*!< Identifier name */

/* GPIO_EMC_06 (coord H5), PWM2_AT */
#define BOARD_INITPWMPINS_PWM2_AT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_AT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_AT_CHANNEL                                     0U   /*!< PWM2 A channel: 0 */
#define BOARD_INITPWMPINS_PWM2_AT_PIN_NAME                           GPIO_EMC_06   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_AT_LABEL                                "PWM2_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_AT_NAME                                 "PWM2_AT"   /*!< Identifier name */

/* GPIO_EMC_07 (coord H4), PWM2_AB */
#define BOARD_INITPWMPINS_PWM2_AB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_AB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_AB_CHANNEL                                     0U   /*!< PWM2 B channel: 0 */
#define BOARD_INITPWMPINS_PWM2_AB_PIN_NAME                           GPIO_EMC_07   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_AB_LABEL                                "PWM2_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_AB_NAME                                 "PWM2_AB"   /*!< Identifier name */

/* GPIO_EMC_08 (coord H3), PWM2_BT */
#define BOARD_INITPWMPINS_PWM2_BT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_BT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_BT_CHANNEL                                     1U   /*!< PWM2 A channel: 1 */
#define BOARD_INITPWMPINS_PWM2_BT_PIN_NAME                           GPIO_EMC_08   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_BT_LABEL                                "PWM2_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_BT_NAME                                 "PWM2_BT"   /*!< Identifier name */

/* GPIO_EMC_09 (coord C2), PWM2_BB */
#define BOARD_INITPWMPINS_PWM2_BB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_BB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_BB_CHANNEL                                     1U   /*!< PWM2 B channel: 1 */
#define BOARD_INITPWMPINS_PWM2_BB_PIN_NAME                           GPIO_EMC_09   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_BB_LABEL                                "PWM2_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_BB_NAME                                 "PWM2_BB"   /*!< Identifier name */

/* GPIO_AD_B0_00 (coord M14), PWM2_CT */
#define BOARD_INITPWMPINS_PWM2_CT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_CT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_CT_CHANNEL                                     3U   /*!< PWM2 A channel: 3 */
#define BOARD_INITPWMPINS_PWM2_CT_PIN_NAME                         GPIO_AD_B0_00   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_CT_LABEL                                "PWM2_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_CT_NAME                                 "PWM2_CT"   /*!< Identifier name */

/* GPIO_AD_B0_01 (coord H10), PWM2_CB */
#define BOARD_INITPWMPINS_PWM2_CB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_CB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_CB_CHANNEL                                     3U   /*!< PWM2 B channel: 3 */
#define BOARD_INITPWMPINS_PWM2_CB_PIN_NAME                         GPIO_AD_B0_01   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_CB_LABEL                                "PWM2_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_CB_NAME                                 "PWM2_CB"   /*!< Identifier name */

/* GPIO_EMC_29 (coord E1), PWM3_AT */
#define BOARD_INITPWMPINS_PWM3_AT_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_AT_SIGNAL                                       A   /*!< PWM3 signal: A */
#define BOARD_INITPWMPINS_PWM3_AT_CHANNEL                                     0U   /*!< PWM3 A channel: 0 */
#define BOARD_INITPWMPINS_PWM3_AT_PIN_NAME                           GPIO_EMC_29   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_AT_LABEL                                "PWM3_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_AT_NAME                                 "PWM3_AT"   /*!< Identifier name */

/* GPIO_EMC_30 (coord C6), PWM3_AB */
#define BOARD_INITPWMPINS_PWM3_AB_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_AB_SIGNAL                                       B   /*!< PWM3 signal: B */
#define BOARD_INITPWMPINS_PWM3_AB_CHANNEL                                     0U   /*!< PWM3 B channel: 0 */
#define BOARD_INITPWMPINS_PWM3_AB_PIN_NAME                           GPIO_EMC_30   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_AB_LABEL                                "PWM3_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_AB_NAME                                 "PWM3_AB"   /*!< Identifier name */

/* GPIO_EMC_31 (coord C5), PWM3_BT */
#define BOARD_INITPWMPINS_PWM3_BT_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_BT_SIGNAL                                       A   /*!< PWM3 signal: A */
#define BOARD_INITPWMPINS_PWM3_BT_CHANNEL                                     1U   /*!< PWM3 A channel: 1 */
#define BOARD_INITPWMPINS_PWM3_BT_PIN_NAME                           GPIO_EMC_31   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_BT_LABEL                                "PWM3_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_BT_NAME                                 "PWM3_BT"   /*!< Identifier name */

/* GPIO_EMC_32 (coord D5), PWM3_BB */
#define BOARD_INITPWMPINS_PWM3_BB_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_BB_SIGNAL                                       B   /*!< PWM3 signal: B */
#define BOARD_INITPWMPINS_PWM3_BB_CHANNEL                                     1U   /*!< PWM3 B channel: 1 */
#define BOARD_INITPWMPINS_PWM3_BB_PIN_NAME                           GPIO_EMC_32   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_BB_LABEL                                "PWM3_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_BB_NAME                                 "PWM3_BB"   /*!< Identifier name */

/* GPIO_EMC_33 (coord C4), PWM3_CT */
#define BOARD_INITPWMPINS_PWM3_CT_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_CT_SIGNAL                                       A   /*!< PWM3 signal: A */
#define BOARD_INITPWMPINS_PWM3_CT_CHANNEL                                     2U   /*!< PWM3 A channel: 2 */
#define BOARD_INITPWMPINS_PWM3_CT_PIN_NAME                           GPIO_EMC_33   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_CT_LABEL                                "PWM3_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_CT_NAME                                 "PWM3_CT"   /*!< Identifier name */

/* GPIO_EMC_34 (coord D4), PWM3_CB */
#define BOARD_INITPWMPINS_PWM3_CB_PERIPHERAL                                PWM3   /*!< Device name: PWM3 */
#define BOARD_INITPWMPINS_PWM3_CB_SIGNAL                                       B   /*!< PWM3 signal: B */
#define BOARD_INITPWMPINS_PWM3_CB_CHANNEL                                     2U   /*!< PWM3 B channel: 2 */
#define BOARD_INITPWMPINS_PWM3_CB_PIN_NAME                           GPIO_EMC_34   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM3_CB_LABEL                                "PWM3_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM3_CB_NAME                                 "PWM3_CB"   /*!< Identifier name */

