jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_EMC_00 (coord E3), PWM4_AT */
#define BOARD_INITPWMPINS_PWM4_AT_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_AT_SIGNAL                                       A   /*!< PWM4 signal: A */
#define BOARD_INITPWMPINS_PWM4_AT_CHANNEL                                     0U   /*!< PWM4 A channel: 0 */
#define BOARD_INITPWMPINS_PWM4_AT_PIN_NAME                           GPIO_EMC_00   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_AT_LABEL                                "PWM4_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_AT_NAME                                 "PWM4_AT"   /*!< Identifier name */

/* GPIO_EMC_01 (coord F3), PWM4_AB */
#define BOARD_INITPWMPINS_PWM4_AB_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_AB_SIGNAL                                       B   /*!< PWM4 signal: B */
#define BOARD_INITPWMPINS_PWM4_AB_CHANNEL                                     0U   /*!< PWM4 B channel: 0 */
#define BOARD_INITPWMPINS_PWM4_AB_PIN_NAME                           GPIO_EMC_01   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_AB_LABEL                                "PWM4_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_AB_NAME                                 "PWM4_AB"   /*!< Identifier name */

/* GPIO_EMC_02 (coord F4), PWM4_BT */
#define BOARD_INITPWMPINS_PWM4_BT_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_BT_SIGNAL                                       A   /*!< PWM4 signal: A */
#define BOARD_INITPWMPINS_PWM4_BT_CHANNEL                                     1U   /*!< PWM4 A channel: 1 */
#define BOARD_INITPWMPINS_PWM4_BT_PIN_NAME                           GPIO_EMC_02   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_BT_LABEL                                "PWM4_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_BT_NAME                                 "PWM4_BT"   /*!< Identifier name */

/* GPIO_EMC_03 (coord G4), PWM4_BB */
#define BOARD_INITPWMPINS_PWM4_BB_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_BB_SIGNAL                                       B   /*!< PWM4 signal: B */
#define BOARD_INITPWMPINS_PWM4_BB_CHANNEL                                     1U   /*!< PWM4 B channel: 1 */
#define BOARD_INITPWMPINS_PWM4_BB_PIN_NAME                           GPIO_EMC_03   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_BB_LABEL                                "PWM4_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_BB_NAME                                 "PWM4_BB"   /*!< Identifier name */

/* GPIO_EMC_04 (coord F2), PWM4_CT */
#define BOARD_INITPWMPINS_PWM4_CT_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_CT_SIGNAL                                       A   /*!< PWM4 signal: A */
#define BOARD_INITPWMPINS_PWM4_CT_CHANNEL                                     2U   /*!< PWM4 A channel: 2 */
#define BOARD_INITPWMPINS_PWM4_CT_PIN_NAME                           GPIO_EMC_04   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_CT_LABEL                                "PWM4_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_CT_NAME                                 "PWM4_CT"   /*!< Identifier name */

/* GPIO_EMC_05 (coord G5), PWM4_CB */
#define BOARD_INITPWMPINS_PWM4_CB_PERIPHERAL                                PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPWMPINS_PWM4_CB_SIGNAL                                       B   /*!< PWM4 signal: B */
#define BOARD_INITPWMPINS_PWM4_CB_CHANNEL                                     2U   /*!< PWM4 B channel: 2 */
#define BOARD_INITPWMPINS_PWM4_CB_PIN_NAME                           GPIO_EMC_05   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM4_CB_LABEL                                "PWM4_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM4_CB_NAME                                 "PWM4_CB"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPwmPins(void);

/* GPIO_EMC_35 (coord E5), ENC1_A */
#define BOARD_INITENCPINS_ENC1_A_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_A_SIGNAL                                    PHASE   /*!< ENC1 signal: PHASE */
#define BOARD_INITENCPINS_ENC1_A_CHANNEL                                       A   /*!< ENC1 PHASE channel: A */
#define BOARD_INITENCPINS_ENC1_A_PIN_NAME                            GPIO_EMC_35   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_A_LABEL                                  "ENC1_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_A_NAME                                   "ENC1_A"   /*!< Identifier name */

/* GPIO_EMC_36 (coord C3), ENC1_B */
#define BOARD_INITENCPINS_ENC1_B_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_B_SIGNAL                                    PHASE   /*!< ENC1 signal: PHASE */
#define BOARD_INITENCPINS_ENC1_B_CHANNEL                                       B   /*!< ENC1 PHASE channel: B */
#define BOARD_INITENCPINS_ENC1_B_PIN_NAME                            GPIO_EMC_36   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_B_LABEL                                  "ENC1_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_B_NAME                                   "ENC1_B"   /*!< Identifier name */

/* GPIO_EMC_37 (coord E4), ENC1_I */
#define BOARD_INITENCPINS_ENC1_I_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_I_SIGNAL                                    INDEX   /*!< ENC1 signal: INDEX */
#define BOARD_INITENCPINS_ENC1_I_PIN_NAME                            GPIO_EMC_37   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_I_LABEL                                  "ENC1_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_I_NAME                                   "ENC1_I"   /*!< Identifier name */

/* GPIO_EMC_13 (coord A6), ENC2_A */
#define BOARD_INITENCPINS_ENC2_A_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_A_SIGNAL                                    PHASE   /*!< ENC2 signal: PHASE */
#define BOARD_INITENCPINS_ENC2_A_CHANNEL                                       A   /*!< ENC2 PHASE channel: A */
#define BOARD_INITENCPINS_ENC2_A_PIN_NAME                            GPIO_EMC_13   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_A_LABEL                                  "ENC2_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_A_NAME                                   "ENC2_A"   /*!< Identifier name */

