jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_EMC_14 (coord B6), ENC2_B */
#define BOARD_INITENCPINS_ENC2_B_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_B_SIGNAL                                    PHASE   /*!< ENC2 signal: PHASE */
#define BOARD_INITENCPINS_ENC2_B_CHANNEL                                       B   /*!< ENC2 PHASE channel: B */
#define BOARD_INITENCPINS_ENC2_B_PIN_NAME                            GPIO_EMC_14   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_B_LABEL                                  "ENC2_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_B_NAME                                   "ENC2_B"   /*!< Identifier name */

/* GPIO_B0_15 (coord E11), ENC2_I */
#define BOARD_INITENCPINS_ENC2_I_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_I_SIGNAL                                    INDEX   /*!< ENC2 signal: INDEX */
#define BOARD_INITENCPINS_ENC2_I_PIN_NAME                             GPIO_B0_15   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_I_LABEL                                  "ENC2_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_I_NAME                                   "ENC2_I"   /*!< Identifier name */

/* GPIO_EMC_15 (coord B1), ENC3_A */
#define BOARD_INITENCPINS_ENC3_A_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_A_SIGNAL                                    PHASE   /*!< ENC3 signal: PHASE */
#define BOARD_INITENCPINS_ENC3_A_CHANNEL                                       A   /*!< ENC3 PHASE channel: A */
#define BOARD_INITENCPINS_ENC3_A_PIN_NAME                            GPIO_EMC_15   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_A_LABEL                                  "ENC3_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_A_NAME                                   "ENC3_A"   /*!< Identifier name */

/* GPIO_EMC_16 (coord A5), ENC3_B */
#define BOARD_INITENCPINS_ENC3_B_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_B_SIGNAL                                    PHASE   /*!< ENC3 signal: PHASE */
#define BOARD_INITENCPINS_ENC3_B_CHANNEL                                       B   /*!< ENC3 PHASE channel: B */
#define BOARD_INITENCPINS_ENC3_B_PIN_NAME                            GPIO_EMC_16   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_B_LABEL                                  "ENC3_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_B_NAME                                   "ENC3_B"   /*!< Identifier name */

/* GPIO_B1_00 (coord A11), ENC3_I */
#define BOARD_INITENCPINS_ENC3_I_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_I_SIGNAL                                    INDEX   /*!< ENC3 signal: INDEX */
#define BOARD_INITENCPINS_ENC3_I_PIN_NAME                             GPIO_B1_00   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_I_LABEL                                  "ENC3_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_I_NAME                                   "ENC3_I"   /*!< Identifier name */

/* GPIO_B1_01 (coord B11), ENC4_A */
#define BOARD_INITENCPINS_ENC4_A_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_A_SIGNAL                                    PHASE   /*!< ENC4 signal: PHASE */
#define BOARD_INITENCPINS_ENC4_A_CHANNEL                                       A   /*!< ENC4 PHASE channel: A */
#define BOARD_INITENCPINS_ENC4_A_PIN_NAME                             GPIO_B1_01   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_A_LABEL                                  "ENC4_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_A_NAME                                   "ENC4_A"   /*!< Identifier name */

/* GPIO_B1_02 (coord C11), ENC4_B */
#define BOARD_INITENCPINS_ENC4_B_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_B_SIGNAL                                    PHASE   /*!< ENC4 signal: PHASE */
#define BOARD_INITENCPINS_ENC4_B_CHANNEL                                       B   /*!< ENC4 PHASE channel: B */
#define BOARD_INITENCPINS_ENC4_B_PIN_NAME                             GPIO_B1_02   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_B_LABEL                                  "ENC4_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_B_NAME                                   "ENC4_B"   /*!< Identifier name */

/* GPIO_B1_03 (coord D11), ENC4_I */
#define BOARD_INITENCPINS_ENC4_I_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_I_SIGNAL                                    INDEX   /*!< ENC4 signal: INDEX */
#define BOARD_INITENCPINS_ENC4_I_PIN_NAME                             GPIO_B1_03   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_I_LABEL                                  "ENC4_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_I_NAME                                   "ENC4_I"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEncPins(void);

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
#define BOARD_INITLCDPINS_LCDIF_CLK_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_CLK_SIGNAL                             lcdif_clk   /*!< LCDIF signal: lcdif_clk */
#define BOARD_INITLCDPINS_LCDIF_CLK_PIN_NAME                          GPIO_B0_00   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_CLK_LABEL                            "LCDIF_CLK"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_CLK_NAME                             "LCDIF_CLK"   /*!< Identifier name */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_SIGNAL                       lcdif_enable   /*!< LCDIF signal: lcdif_enable */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PIN_NAME                       GPIO_B0_01   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_LABEL                      "LCDIF_ENABLE"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_NAME                       "LCDIF_ENABLE"   /*!< Identifier name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PERIPHERAL                           LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_SIGNAL                         lcdif_hsync   /*!< LCDIF signal: lcdif_hsync */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PIN_NAME                        GPIO_B0_02   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_LABEL                        "LCDIF_HSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_NAME                         "LCDIF_HSYNC"   /*!< Identifier name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PERIPHERAL                           LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_SIGNAL                         lcdif_vsync   /*!< LCDIF signal: lcdif_vsync */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PIN_NAME                        GPIO_B0_03   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_LABEL                        "LCDIF_VSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_NAME                         "LCDIF_VSYNC"   /*!< Identifier name */

/* GPIO_B0_04 (coord C8), LCDIF_DATA00 */
#define BOARD_INITLCDPINS_LCDIF_DATA00_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA00_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA00_CHANNEL                                0U   /*!< LCDIF lcdif_data channel: 00 */
#define BOARD_INITLCDPINS_LCDIF_DATA00_PIN_NAME                       GPIO_B0_04   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA00_LABEL                      "LCDIF_DATA00"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA00_NAME                       "LCDIF_DATA00"   /*!< Identifier name */

