jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_B0_05 (coord B8), LCDIF_DATA01 */
#define BOARD_INITLCDPINS_LCDIF_DATA01_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA01_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA01_CHANNEL                                1U   /*!< LCDIF lcdif_data channel: 01 */
#define BOARD_INITLCDPINS_LCDIF_DATA01_PIN_NAME                       GPIO_B0_05   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA01_LABEL                      "LCDIF_DATA01"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA01_NAME                       "LCDIF_DATA01"   /*!< Identifier name */

/* GPIO_B0_06 (coord A8), LCDIF_DATA02 */
#define BOARD_INITLCDPINS_LCDIF_DATA02_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA02_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA02_CHANNEL                                2U   /*!< LCDIF lcdif_data channel: 02 */
#define BOARD_INITLCDPINS_LCDIF_DATA02_PIN_NAME                       GPIO_B0_06   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA02_LABEL                      "LCDIF_DATA02"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA02_NAME                       "LCDIF_DATA02"   /*!< Identifier name */

/* GPIO_B0_07 (coord A9), LCDIF_DATA03 */
#define BOARD_INITLCDPINS_LCDIF_DATA03_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA03_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA03_CHANNEL                                3U   /*!< LCDIF lcdif_data channel: 03 */
#define BOARD_INITLCDPINS_LCDIF_DATA03_PIN_NAME                       GPIO_B0_07   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA03_LABEL                      "LCDIF_DATA03"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA03_NAME                       "LCDIF_DATA03"   /*!< Identifier name */

/* GPIO_B0_08 (coord B9), LCDIF_DATA04 */
#define BOARD_INITLCDPINS_LCDIF_DATA04_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA04_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA04_CHANNEL                                4U   /*!< LCDIF lcdif_data channel: 04 */
#define BOARD_INITLCDPINS_LCDIF_DATA04_PIN_NAME                       GPIO_B0_08   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA04_LABEL                      "LCDIF_DATA04"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA04_NAME                       "LCDIF_DATA04"   /*!< Identifier name */

/* GPIO_B0_09 (coord C9), LCDIF_DATA05 */
#define BOARD_INITLCDPINS_LCDIF_DATA05_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA05_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA05_CHANNEL                                5U   /*!< LCDIF lcdif_data channel: 05 */
#define BOARD_INITLCDPINS_LCDIF_DATA05_PIN_NAME                       GPIO_B0_09   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA05_LABEL                      "LCDIF_DATA05"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA05_NAME                       "LCDIF_DATA05"   /*!< Identifier name */

/* GPIO_B0_10 (coord D9), LCDIF_DATA06 */
#define BOARD_INITLCDPINS_LCDIF_DATA06_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA06_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA06_CHANNEL                                6U   /*!< LCDIF lcdif_data channel: 06 */
#define BOARD_INITLCDPINS_LCDIF_DATA06_PIN_NAME                       GPIO_B0_10   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA06_LABEL                      "LCDIF_DATA06"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA06_NAME                       "LCDIF_DATA06"   /*!< Identifier name */

/* GPIO_B0_11 (coord A10), LCDIF_DATA07 */
#define BOARD_INITLCDPINS_LCDIF_DATA07_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_DATA07_SIGNAL                         lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_DATA07_CHANNEL                                7U   /*!< LCDIF lcdif_data channel: 07 */
#define BOARD_INITLCDPINS_LCDIF_DATA07_PIN_NAME                       GPIO_B0_11   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_DATA07_LABEL                      "LCDIF_DATA07"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_DATA07_NAME                       "LCDIF_DATA07"   /*!< Identifier name */

/* GPIO_AD_B0_11 (coord G10), LCD_TOUCH_INT */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_GPIO                               GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_PORT                               GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_GPIO_PIN                             11U   /*!< GPIO1 pin index: 11 */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_PIN_NAME                   GPIO_AD_B0_11   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_LABEL                    "LCD_TOUCH_INT"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_NAME                     "LCD_TOUCH_INT"   /*!< Identifier name */
#define BOARD_INITLCDPINS_LCD_TOUCH_INT_DIRECTION        kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_EMC_40 (coord A7), LCD_RST */
#define BOARD_INITLCDPINS_LCD_RST_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITLCDPINS_LCD_RST_PORT                                     GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITLCDPINS_LCD_RST_GPIO_PIN                                   26U   /*!< GPIO3 pin index: 26 */
#define BOARD_INITLCDPINS_LCD_RST_PIN_NAME                           GPIO_EMC_40   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_RST_LABEL                                "LCD_RST"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_RST_NAME                                 "LCD_RST"   /*!< Identifier name */
#define BOARD_INITLCDPINS_LCD_RST_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

