jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_AD_B0_09 (coord F14), ENET_RST */
#define BOARD_INITENETPINS_ENET_RST_GPIO                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITENETPINS_ENET_RST_PORT                                   GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITENETPINS_ENET_RST_GPIO_PIN                                  9U   /*!< GPIO1 pin index: 9 */
#define BOARD_INITENETPINS_ENET_RST_PIN_NAME                       GPIO_AD_B0_09   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RST_LABEL                             "ENET_RST"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RST_NAME                              "ENET_RST"   /*!< Identifier name */
#define BOARD_INITENETPINS_ENET_RST_DIRECTION           kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_AD_B0_10 (coord G13), ENET_INT */
#define BOARD_INITENETPINS_ENET_INT_GPIO                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITENETPINS_ENET_INT_PORT                                   GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITENETPINS_ENET_INT_GPIO_PIN                                 10U   /*!< GPIO1 pin index: 10 */
#define BOARD_INITENETPINS_ENET_INT_PIN_NAME                       GPIO_AD_B0_10   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_INT_LABEL                             "ENET_INT"   /*!< Label */
#define BOARD_INITENETPINS_ENET_INT_NAME                              "ENET_INT"   /*!< Identifier name */
#define BOARD_INITENETPINS_ENET_INT_DIRECTION            kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnetPins(void);

/* GPIO_SD_B1_00 (coord L5), FLEXSPI_B_DATA3 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA3_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA3_SIGNAL             FLEXSPI_B_DATA3   /*!< FLEXSPI signal: FLEXSPI_B_DATA3 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA3_PIN_NAME             GPIO_SD_B1_00   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA3_LABEL            "FLEXSPI_B_DATA3"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA3_NAME             "FLEXSPI_B_DATA3"   /*!< Identifier name */

/* GPIO_SD_B1_01 (coord M5), FLEXSPI_B_DATA2 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA2_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA2_SIGNAL             FLEXSPI_B_DATA2   /*!< FLEXSPI signal: FLEXSPI_B_DATA2 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA2_PIN_NAME             GPIO_SD_B1_01   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA2_LABEL            "FLEXSPI_B_DATA2"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA2_NAME             "FLEXSPI_B_DATA2"   /*!< Identifier name */

/* GPIO_SD_B1_02 (coord M3), FLEXSPI_B_DATA1 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA1_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA1_SIGNAL             FLEXSPI_B_DATA1   /*!< FLEXSPI signal: FLEXSPI_B_DATA1 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA1_PIN_NAME             GPIO_SD_B1_02   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA1_LABEL            "FLEXSPI_B_DATA1"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA1_NAME             "FLEXSPI_B_DATA1"   /*!< Identifier name */

/* GPIO_SD_B1_03 (coord M4), FLEXSPI_B_DATA0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA0_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA0_SIGNAL             FLEXSPI_B_DATA0   /*!< FLEXSPI signal: FLEXSPI_B_DATA0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA0_PIN_NAME             GPIO_SD_B1_03   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA0_LABEL            "FLEXSPI_B_DATA0"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_DATA0_NAME             "FLEXSPI_B_DATA0"   /*!< Identifier name */

/* GPIO_SD_B1_04 (coord P2), FLEXSPI_B_SCLK */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SCLK_PERIPHERAL                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SCLK_SIGNAL               FLEXSPI_B_SCLK   /*!< FLEXSPI signal: FLEXSPI_B_SCLK */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SCLK_PIN_NAME              GPIO_SD_B1_04   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SCLK_LABEL              "FLEXSPI_B_SCLK"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SCLK_NAME               "FLEXSPI_B_SCLK"   /*!< Identifier name */

/* GPIO_SD_B1_05 (coord N3), FLEXSPI_B_SS0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SS0_PERIPHERAL                   FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SS0_SIGNAL               FLEXSPI_B_SS0_B   /*!< FLEXSPI signal: FLEXSPI_B_SS0_B */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SS0_PIN_NAME               GPIO_SD_B1_05   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SS0_LABEL                "FLEXSPI_B_SS0"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_B_SS0_NAME                 "FLEXSPI_B_SS0"   /*!< Identifier name */

/* GPIO_SD_B1_06 (coord L3), FLEXSPI_A_SS0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SS0_PERIPHERAL                   FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SS0_SIGNAL               FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SS0_PIN_NAME               GPIO_SD_B1_06   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SS0_LABEL                "FLEXSPI_A_SS0"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SS0_NAME                 "FLEXSPI_A_SS0"   /*!< Identifier name */

/* GPIO_SD_B1_07 (coord L4), FLEXSPI_A_SCLK */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SCLK_PERIPHERAL                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SCLK_SIGNAL               FLEXSPI_A_SCLK   /*!< FLEXSPI signal: FLEXSPI_A_SCLK */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SCLK_PIN_NAME              GPIO_SD_B1_07   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SCLK_LABEL              "FLEXSPI_A_SCLK"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_SCLK_NAME               "FLEXSPI_A_SCLK"   /*!< Identifier name */

/* GPIO_SD_B1_08 (coord P3), FLEXSPI_A_DATA0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA0_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA0_SIGNAL             FLEXSPI_A_DATA0   /*!< FLEXSPI signal: FLEXSPI_A_DATA0 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA0_PIN_NAME             GPIO_SD_B1_08   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA0_LABEL            "FLEXSPI_A_DATA0"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA0_NAME             "FLEXSPI_A_DATA0"   /*!< Identifier name */

/* GPIO_SD_B1_09 (coord N4), FLEXSPI_A_DATA1 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA1_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA1_SIGNAL             FLEXSPI_A_DATA1   /*!< FLEXSPI signal: FLEXSPI_A_DATA1 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA1_PIN_NAME             GPIO_SD_B1_09   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA1_LABEL            "FLEXSPI_A_DATA1"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA1_NAME             "FLEXSPI_A_DATA1"   /*!< Identifier name */

/* GPIO_SD_B1_10 (coord P4), FLEXSPI_A_DATA2 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA2_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA2_SIGNAL             FLEXSPI_A_DATA2   /*!< FLEXSPI signal: FLEXSPI_A_DATA2 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA2_PIN_NAME             GPIO_SD_B1_10   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA2_LABEL            "FLEXSPI_A_DATA2"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA2_NAME             "FLEXSPI_A_DATA2"   /*!< Identifier name */

/* GPIO_SD_B1_11 (coord P5), FLEXSPI_A_DATA3 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA3_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA3_SIGNAL             FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA3_PIN_NAME             GPIO_SD_B1_11   /*!< Pin name */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA3_LABEL            "FLEXSPI_A_DATA3"   /*!< Label */
#define BOARD_INITFLEXSPIPINS_FLEXSPI_A_DATA3_NAME             "FLEXSPI_A_DATA3"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPIPins(void);

/* GPIO_B1_12 (coord D13), USDHC1_CD_B */
#define BOARD_INITUSDHCPINS_USDHC1_CD_B_PERIPHERAL                        USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_CD_B_SIGNAL                        usdhc_cd_b   /*!< USDHC1 signal: usdhc_cd_b */
#define BOARD_INITUSDHCPINS_USDHC1_CD_B_PIN_NAME                      GPIO_B1_12   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_CD_B_LABEL                      "USDHC1_CD_B"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_CD_B_NAME                       "USDHC1_CD_B"   /*!< Identifier name */

/* GPIO_SD_B0_00 (coord J4), USDHC1_CMD */
#define BOARD_INITUSDHCPINS_USDHC1_CMD_PERIPHERAL                         USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_CMD_SIGNAL                          usdhc_cmd   /*!< USDHC1 signal: usdhc_cmd */
#define BOARD_INITUSDHCPINS_USDHC1_CMD_PIN_NAME                    GPIO_SD_B0_00   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_CMD_LABEL                        "USDHC1_CMD"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_CMD_NAME                         "USDHC1_CMD"   /*!< Identifier name */

/* GPIO_SD_B0_01 (coord J3), USDHC1_CLK */
#define BOARD_INITUSDHCPINS_USDHC1_CLK_PERIPHERAL                         USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_CLK_SIGNAL                          usdhc_clk   /*!< USDHC1 signal: usdhc_clk */
#define BOARD_INITUSDHCPINS_USDHC1_CLK_PIN_NAME                    GPIO_SD_B0_01   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_CLK_LABEL                        "USDHC1_CLK"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_CLK_NAME                         "USDHC1_CLK"   /*!< Identifier name */

/* GPIO_SD_B0_02 (coord J1), USDHC1_DATA0 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_PERIPHERAL                       USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_SIGNAL                       usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_CHANNEL                              0U   /*!< USDHC1 usdhc_data channel: 0 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_PIN_NAME                  GPIO_SD_B0_02   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_LABEL                    "USDHC1_DATA0"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_DATA0_NAME                     "USDHC1_DATA0"   /*!< Identifier name */

/* GPIO_SD_B0_03 (coord K1), USDHC1_DATA1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_PERIPHERAL                       USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_SIGNAL                       usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_CHANNEL                              1U   /*!< USDHC1 usdhc_data channel: 1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_PIN_NAME                  GPIO_SD_B0_03   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_LABEL                    "USDHC1_DATA1"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_DATA1_NAME                     "USDHC1_DATA1"   /*!< Identifier name */

/* GPIO_SD_B0_04 (coord H2), USDHC1_DATA2 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_PERIPHERAL                       USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_SIGNAL                       usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_CHANNEL                              2U   /*!< USDHC1 usdhc_data channel: 2 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_PIN_NAME                  GPIO_SD_B0_04   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_LABEL                    "USDHC1_DATA2"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_DATA2_NAME                     "USDHC1_DATA2"   /*!< Identifier name */

/* GPIO_SD_B0_05 (coord J2), USDHC1_DATA3 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_PERIPHERAL                       USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_SIGNAL                       usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_CHANNEL                              3U   /*!< USDHC1 usdhc_data channel: 3 */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_PIN_NAME                  GPIO_SD_B0_05   /*!< Pin name */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_LABEL                    "USDHC1_DATA3"   /*!< Label */
#define BOARD_INITUSDHCPINS_USDHC1_DATA3_NAME                     "USDHC1_DATA3"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUsdhcPins(void);

/* GPIO_EMC_19 (coord B4), MODBUS_PROFIBUS_TX */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_TX_PERIPHERAL                 LPUART4   /*!< Device name: LPUART4 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_TX_SIGNAL                          TX   /*!< LPUART4 signal: TX */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_TX_PIN_NAME               GPIO_EMC_19   /*!< Pin name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_TX_LABEL         "MODBUS_PROFIBUS_TX"   /*!< Label */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_TX_NAME          "MODBUS_PROFIBUS_TX"   /*!< Identifier name */

/* GPIO_EMC_20 (coord A3), MODBUS_PROFIBUS_RX */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RX_PERIPHERAL                 LPUART4   /*!< Device name: LPUART4 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RX_SIGNAL                          RX   /*!< LPUART4 signal: RX */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RX_PIN_NAME               GPIO_EMC_20   /*!< Pin name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RX_LABEL         "MODBUS_PROFIBUS_RX"   /*!< Label */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RX_NAME          "MODBUS_PROFIBUS_RX"   /*!< Identifier name */

/* GPIO_AD_B0_02 (coord M11), SERIAL_TX */
#define BOARD_INITUARTPINS_SERIAL_TX_PERIPHERAL                          LPUART6   /*!< Device name: LPUART6 */
#define BOARD_INITUARTPINS_SERIAL_TX_SIGNAL                                   TX   /*!< LPUART6 signal: TX */
#define BOARD_INITUARTPINS_SERIAL_TX_PIN_NAME                      GPIO_AD_B0_02   /*!< Pin name */
#define BOARD_INITUARTPINS_SERIAL_TX_LABEL                           "SERIAL_TX"   /*!< Label */
#define BOARD_INITUARTPINS_SERIAL_TX_NAME                            "SERIAL_TX"   /*!< Identifier name */

/* GPIO_AD_B0_03 (coord G11), SERIAL_RX */
#define BOARD_INITUARTPINS_SERIAL_RX_PERIPHERAL                          LPUART6   /*!< Device name: LPUART6 */
#define BOARD_INITUARTPINS_SERIAL_RX_SIGNAL                                   RX   /*!< LPUART6 signal: RX */
#define BOARD_INITUARTPINS_SERIAL_RX_PIN_NAME                      GPIO_AD_B0_03   /*!< Pin name */
#define BOARD_INITUARTPINS_SERIAL_RX_LABEL                           "SERIAL_RX"   /*!< Label */
#define BOARD_INITUARTPINS_SERIAL_RX_NAME                            "SERIAL_RX"   /*!< Identifier name */

/* GPIO_EMC_38 (coord D6), MODBUS_PROFIBUS_DE */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_GPIO                         GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_PORT                         GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_GPIO_PIN                       24U   /*!< GPIO3 pin index: 24 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_PIN_NAME               GPIO_EMC_38   /*!< Pin name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_LABEL         "MODBUS_PROFIBUS_DE"   /*!< Label */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_NAME          "MODBUS_PROFIBUS_DE"   /*!< Identifier name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_DE_DIRECTION kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_EMC_39 (coord B7), MODBUS_PROFIBUS_RE */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_GPIO                         GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_PORT                         GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_GPIO_PIN                       25U   /*!< GPIO3 pin index: 25 */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_PIN_NAME               GPIO_EMC_39   /*!< Pin name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_LABEL         "MODBUS_PROFIBUS_RE"   /*!< Label */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_NAME          "MODBUS_PROFIBUS_RE"   /*!< Identifier name */
#define BOARD_INITUARTPINS_MODBUS_PROFIBUS_RE_DIRECTION kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUartPins(void);

