jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_EMC_21 (coord C1), SECURITY_SDA */
#define BOARD_INITI2CPINS_SECURITY_SDA_PERIPHERAL                         LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITI2CPINS_SECURITY_SDA_SIGNAL                                SDA   /*!< LPI2C3 signal: SDA */
#define BOARD_INITI2CPINS_SECURITY_SDA_PIN_NAME                      GPIO_EMC_21   /*!< Pin name */
#define BOARD_INITI2CPINS_SECURITY_SDA_LABEL                      "SECURITY_SDA"   /*!< Label */
#define BOARD_INITI2CPINS_SECURITY_SDA_NAME                       "SECURITY_SDA"   /*!< Identifier name */

/* GPIO_EMC_22 (coord F1), SECURITY_SCL */
#define BOARD_INITI2CPINS_SECURITY_SCL_PERIPHERAL                         LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITI2CPINS_SECURITY_SCL_SIGNAL                                SCL   /*!< LPI2C3 signal: SCL */
#define BOARD_INITI2CPINS_SECURITY_SCL_PIN_NAME                      GPIO_EMC_22   /*!< Pin name */
#define BOARD_INITI2CPINS_SECURITY_SCL_LABEL                      "SECURITY_SCL"   /*!< Label */
#define BOARD_INITI2CPINS_SECURITY_SCL_NAME                       "SECURITY_SCL"   /*!< Identifier name */

/* GPIO_EMC_11 (coord G3), LCD_TOUCH_SDA */
#define BOARD_INITI2CPINS_LCD_TOUCH_SDA_PERIPHERAL                        LPI2C4   /*!< Device name: LPI2C4 */
#define BOARD_INITI2CPINS_LCD_TOUCH_SDA_SIGNAL                               SDA   /*!< LPI2C4 signal: SDA */
#define BOARD_INITI2CPINS_LCD_TOUCH_SDA_PIN_NAME                     GPIO_EMC_11   /*!< Pin name */
#define BOARD_INITI2CPINS_LCD_TOUCH_SDA_LABEL                    "LCD_TOUCH_SDA"   /*!< Label */
#define BOARD_INITI2CPINS_LCD_TOUCH_SDA_NAME                     "LCD_TOUCH_SDA"   /*!< Identifier name */

/* GPIO_EMC_12 (coord H1), LCD_TOUCH_SCL */
#define BOARD_INITI2CPINS_LCD_TOUCH_SCL_PERIPHERAL                        LPI2C4   /*!< Device name: LPI2C4 */
#define BOARD_INITI2CPINS_LCD_TOUCH_SCL_SIGNAL                               SCL   /*!< LPI2C4 signal: SCL */
#define BOARD_INITI2CPINS_LCD_TOUCH_SCL_PIN_NAME                     GPIO_EMC_12   /*!< Pin name */
#define BOARD_INITI2CPINS_LCD_TOUCH_SCL_LABEL                    "LCD_TOUCH_SCL"   /*!< Label */
#define BOARD_INITI2CPINS_LCD_TOUCH_SCL_NAME                     "LCD_TOUCH_SCL"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2cPins(void);

/* GPIO_AD_B0_06 (coord E14), SWD_DIO */
#define BOARD_INITSWDPINS_SWD_DIO_PERIPHERAL                                JTAG   /*!< Device name: JTAG */
#define BOARD_INITSWDPINS_SWD_DIO_SIGNAL                                     TMS   /*!< JTAG signal: TMS */
#define BOARD_INITSWDPINS_SWD_DIO_PIN_NAME                         GPIO_AD_B0_06   /*!< Pin name */
#define BOARD_INITSWDPINS_SWD_DIO_LABEL                                "SWD_DIO"   /*!< Label */
#define BOARD_INITSWDPINS_SWD_DIO_NAME                                 "SWD_DIO"   /*!< Identifier name */

/* GPIO_AD_B0_07 (coord F12), SWD_CLK */
#define BOARD_INITSWDPINS_SWD_CLK_PERIPHERAL                                JTAG   /*!< Device name: JTAG */
#define BOARD_INITSWDPINS_SWD_CLK_SIGNAL                                     TCK   /*!< JTAG signal: TCK */
#define BOARD_INITSWDPINS_SWD_CLK_PIN_NAME                         GPIO_AD_B0_07   /*!< Pin name */
#define BOARD_INITSWDPINS_SWD_CLK_LABEL                                "SWD_CLK"   /*!< Label */
#define BOARD_INITSWDPINS_SWD_CLK_NAME                                 "SWD_CLK"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSwdPins(void);

/* GPIO_AD_B0_04 (coord F11), USER_BUTTON1 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_GPIO                         GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_PORT                         GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_GPIO_PIN                        4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_PIN_NAME             GPIO_AD_B0_04   /*!< Pin name */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_LABEL               "USER_BUTTON1"   /*!< Label */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_NAME                "USER_BUTTON1"   /*!< Identifier name */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON1_DIRECTION  kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_AD_B0_05 (coord G14), USER_BUTTON2 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_GPIO                         GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_PORT                         GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_GPIO_PIN                        5U   /*!< GPIO1 pin index: 5 */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_PIN_NAME             GPIO_AD_B0_05   /*!< Pin name */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_LABEL               "USER_BUTTON2"   /*!< Label */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_NAME                "USER_BUTTON2"   /*!< Identifier name */
#define BOARD_INITUSERBUTTONPINS_USER_BUTTON2_DIRECTION  kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUserButtonPins(void);

/* GPIO_B0_13 (coord D10), USER_LED1 */
#define BOARD_INITUSERLEDPINS_USER_LED1_GPIO                               GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITUSERLEDPINS_USER_LED1_PORT                               GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITUSERLEDPINS_USER_LED1_GPIO_PIN                             13U   /*!< GPIO2 pin index: 13 */
#define BOARD_INITUSERLEDPINS_USER_LED1_PIN_NAME                      GPIO_B0_13   /*!< Pin name */
#define BOARD_INITUSERLEDPINS_USER_LED1_LABEL                        "USER_LED1"   /*!< Label */
#define BOARD_INITUSERLEDPINS_USER_LED1_NAME                         "USER_LED1"   /*!< Identifier name */
#define BOARD_INITUSERLEDPINS_USER_LED1_DIRECTION       kPIN_MUX_DirectionOutput   /*!< Direction */

