jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_B0_14 (coord E10), USER_LED2 */
#define BOARD_INITUSERLEDPINS_USER_LED2_GPIO                               GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITUSERLEDPINS_USER_LED2_PORT                               GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITUSERLEDPINS_USER_LED2_GPIO_PIN                             14U   /*!< GPIO2 pin index: 14 */
#define BOARD_INITUSERLEDPINS_USER_LED2_PIN_NAME                      GPIO_B0_14   /*!< Pin name */
#define BOARD_INITUSERLEDPINS_USER_LED2_LABEL                        "USER_LED2"   /*!< Label */
#define BOARD_INITUSERLEDPINS_USER_LED2_NAME                         "USER_LED2"   /*!< Identifier name */
#define BOARD_INITUSERLEDPINS_USER_LED2_DIRECTION       kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_EMC_41 (coord C7), USER_LED4 */
#define BOARD_INITUSERLEDPINS_USER_LED4_GPIO                               GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITUSERLEDPINS_USER_LED4_PORT                               GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITUSERLEDPINS_USER_LED4_GPIO_PIN                             27U   /*!< GPIO3 pin index: 27 */
#define BOARD_INITUSERLEDPINS_USER_LED4_PIN_NAME                     GPIO_EMC_41   /*!< Pin name */
#define BOARD_INITUSERLEDPINS_USER_LED4_LABEL                        "USER_LED4"   /*!< Label */
#define BOARD_INITUSERLEDPINS_USER_LED4_NAME                         "USER_LED4"   /*!< Identifier name */

/* GPIO_EMC_10 (coord G1), USER_LED3 */
#define BOARD_INITUSERLEDPINS_USER_LED3_GPIO                               GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITUSERLEDPINS_USER_LED3_PORT                               GPIO4   /*!< PORT device name: GPIO4 */
#define BOARD_INITUSERLEDPINS_USER_LED3_GPIO_PIN                             10U   /*!< GPIO4 pin index: 10 */
#define BOARD_INITUSERLEDPINS_USER_LED3_PIN_NAME                     GPIO_EMC_10   /*!< Pin name */
#define BOARD_INITUSERLEDPINS_USER_LED3_LABEL                        "USER_LED3"   /*!< Label */
#define BOARD_INITUSERLEDPINS_USER_LED3_NAME                         "USER_LED3"   /*!< Identifier name */
#define BOARD_INITUSERLEDPINS_USER_LED3_DIRECTION       kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUserLedPins(void);

/* GPIO_B0_12 (coord C10), PERI_PWDN */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_GPIO                            GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_PORT                            GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_GPIO_PIN                          12U   /*!< GPIO2 pin index: 12 */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_PIN_NAME                   GPIO_B0_12   /*!< Pin name */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_LABEL                     "PERI_PWDN"   /*!< Label */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_NAME                      "PERI_PWDN"   /*!< Identifier name */
#define BOARD_INITADDITIONALPINS_PERI_PWDN_DIRECTION    kPIN_MUX_DirectionOutput   /*!< Direction */

/* PMIC_STBY_REQ (coord L7), PERI_PWR_ENABLE */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_GPIO                      GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_PORT                      GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_GPIO_PIN                     2U   /*!< GPIO5 pin index: 2 */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_PIN_NAME          PMIC_STBY_REQ   /*!< Pin name */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_LABEL         "PERI_PWR_ENABLE"   /*!< Label */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_NAME          "PERI_PWR_ENABLE"   /*!< Identifier name */
#define BOARD_INITADDITIONALPINS_PERI_PWR_ENABLE_DIRECTION kPIN_MUX_DirectionOutput /*!< Direction */

/* WAKEUP (coord L6), WAKEUP */
#define BOARD_INITADDITIONALPINS_WAKEUP_GPIO                               GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_WAKEUP_PORT                               GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_WAKEUP_GPIO_PIN                              0U   /*!< GPIO5 pin index: 0 */
#define BOARD_INITADDITIONALPINS_WAKEUP_PIN_NAME                          WAKEUP   /*!< Pin name */
#define BOARD_INITADDITIONALPINS_WAKEUP_LABEL                           "WAKEUP"   /*!< Label */
#define BOARD_INITADDITIONALPINS_WAKEUP_NAME                            "WAKEUP"   /*!< Identifier name */

/* GPIO_B1_13 (coord D14), WDOG1_B */
#define BOARD_INITADDITIONALPINS_WDOG1_B_PERIPHERAL                        WDOG1   /*!< Device name: WDOG1 */
#define BOARD_INITADDITIONALPINS_WDOG1_B_SIGNAL                           wdog_b   /*!< WDOG1 signal: wdog_b */
#define BOARD_INITADDITIONALPINS_WDOG1_B_PIN_NAME                     GPIO_B1_13   /*!< Pin name */
#define BOARD_INITADDITIONALPINS_WDOG1_B_LABEL                         "WDOG1_B"   /*!< Label */
#define BOARD_INITADDITIONALPINS_WDOG1_B_NAME                          "WDOG1_B"   /*!< Identifier name */

/* PMIC_ON_REQ (coord K7), PMIC_ON_REQ */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_GPIO                          GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_PORT                          GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_GPIO_PIN                         1U   /*!< GPIO5 pin index: 1 */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_PIN_NAME                PMIC_ON_REQ   /*!< Pin name */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_LABEL                 "PMIC_ON_REQ"   /*!< Label */
#define BOARD_INITADDITIONALPINS_PMIC_ON_REQ_NAME                  "PMIC_ON_REQ"   /*!< Identifier name */


/* GPIO_B0_08 (coord G11), NFC_IRQ */
#define BOARD_INITPINS_NFC_IRQ_GPIO                                        GPIO2   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_NFC_IRQ_PORT                                        GPIO2   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_NFC_IRQ_GPIO_PIN                                       8U   /*!< GPIO1 pin index: 3 */
#define BOARD_INITPINS_NFC_IRQ_PIN_NAME                               GPIO_B0_08   /*!< Pin name */
#define BOARD_INITPINS_NFC_IRQ_LABEL                                   "NFC_IRQ"   /*!< Label */
#define BOARD_INITPINS_NFC_IRQ_NAME                                    "NFC_IRQ"   /*!< Identifier name */
#define BOARD_INITPINS_NFC_IRQ_DIRECTION                 kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_B0_09 (coord M12), NFC_VEN */
#define BOARD_INITPINS_NFC_VEN_GPIO                                        GPIO2   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_NFC_VEN_PORT                                        GPIO2   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_NFC_VEN_GPIO_PIN                                       9U   /*!< GPIO1 pin index: 19 */
#define BOARD_INITPINS_NFC_VEN_PIN_NAME                               GPIO_B0_09   /*!< Pin name */
#define BOARD_INITPINS_NFC_VEN_LABEL                                   "NFC_VEN"   /*!< Label */
#define BOARD_INITPINS_NFC_VEN_NAME                                    "NFC_VEN"   /*!< Identifier name */
#define BOARD_INITPINS_NFC_VEN_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAdditionalPins(void);

/*!
 * @brief Reonfigures LCD pins to I2C (NCF based) pins.
 *
 */
void BOARD_InitNfcPins(void);

/*!
 * @brief Reonfigures I2C (NCF based)to LCD pins pins.
 *
 */
void BOARD_DeinitNfcPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
